app/views/pages/dashboard.html.erb

SELECT  "budgets".* FROM "budgets" WHERE "budgets"."user_id" = ? LIMIT ?  [["user_id", 1], ["LIMIT", 1]]
---
					<ul>
						<% current_user.budget.categories.each do |list| %>

SELECT "transactions".* FROM "transactions" WHERE "transactions"."budget_id" = ?  [["budget_id", 1]]
SELECT SUM() FROM "transactions" WHERE "transactions"."budget_id" = ?  [["budget_id", 1]]
---
								</li>
								<% current_user.budget.transactions.each do |cat| %>