app/controllers/budgets_controller.rb

INSERT INTO "budgets" ("start_time", "starting_cash", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["start_time", "2017-10-23 03:36:56.830969"], ["starting_cash", 100.0], ["created_at", "2017-10-23 03:36:56.833608"], ["updated_at", "2017-10-23 03:36:56.833608"], ["user_id", 2]]
---
	def create
		@user = current_user
		@budget = Budget.create(budget_params)