app/controllers/pages_controller.rb

	def index
		if user_signed_in?
			if Budget.exists?(user_id: current_user.id)
---
SELECT  "budgets".* FROM "budgets" WHERE "budgets"."user_id" = ? LIMIT ?  [["user_id", 1], ["LIMIT", 1]]
SELECT  1 AS one FROM "budgets" WHERE "budgets"."user_id" = ? LIMIT ?  [["user_id", 2], ["LIMIT", 1]]

	def dashboard
		current_user.budget.current_cash = current_user.budget.starting_cash + current_user.budget.transactions.sum(:amount)
---
SELECT  "budgets".* FROM "budgets" WHERE "budgets"."user_id" = ? LIMIT ?  [["user_id", 1], ["LIMIT", 1]]
SELECT "transactions".* FROM "transactions" WHERE "transactions"."budget_id" = ?  [["budget_id", 1]]
SELECT SUM("transactions"."amount") FROM "transactions" WHERE "transactions"."budget_id" = ?  [["budget_id", 1]]