app/controllers/transactions_controller.rb

	def create
		if params[:commit] == "Add to Category"
			flash[:notice] = "Transaction added successfully."
			@budget = current_user.budget
			@transaction = @budget.transactions.create(transaction_params)
			redirect_to pages_dashboard_path
		else
			flash[:notice] = "Auto budget successfully added."
			@t = []
			current_user.budget.categories.count.times do |i|
---
INSERT INTO "transactions" ("name", "amount", "created_at", "updated_at", "budget_id") VALUES (?, ?, ?, ?, ?)  [["name", "Paid"], ["amount", 100.0], ["created_at", "2017-10-23 18:38:30.212933"], ["updated_at", "2017-10-23 18:38:30.212933"], ["budget_id", 1]]
SELECT  "budgets".* FROM "budgets" WHERE "budgets"."user_id" = ? LIMIT ?  [["user_id", 1], ["LIMIT", 1]]