app/views/transactions/_form.html.erb

SELECT  "budgets".* FROM "budgets" WHERE "budgets"."user_id" = ? LIMIT ?  [["user_id", 2], ["LIMIT", 1]]
---
		<%= form.label :category_id, class: 'label' %>
		<%= form.select :category_id, current_user.budget.categories.collect {|c| [c.name, c.id]} %>